### Import the libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")
%matplotlib inline
sns.set()

In [2]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\priye\anaconda3\envs\python_3.7\lib\site-packages (1.2.0)

### Import the datasets

In [3]:
df_online_retail = pd.read_excel('E:/Xzane/Priyesh/Courses - Training materials/Simplilearn/Capstone/Retail/Datasets/Project 3/Online Retail.xlsx')

In [4]:
df_train = pd.read_excel('E:/Xzane/Priyesh/Courses - Training materials/Simplilearn/Capstone/Retail/Datasets/Project 3 datasets/train.xlsx')

In [5]:
df_test = pd.read_excel('E:/Xzane/Priyesh/Courses - Training materials/Simplilearn/Capstone/Retail/Datasets/Project 3 datasets/test.xlsx')

#### Project Task: Week 1

In [6]:
# Check Data
df_online_retail.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [7]:
df_train.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,558904,22292,HANGING CHICK YELLOW DECORATION,1,2011-07-04 16:18:00,1.25,NaN,United Kingdom
1,556072,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,8,2011-06-08 14:57:00,3.75,16126.0,United Kingdom

In [8]:
df_test.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,562955,84660c,PINK STITCHED WALL CLOCK,3,2011-08-11 10:14:00,7.46,NaN,United Kingdom
1,548451,22707,WRAP MONSTER FUN,50,2011-03-31 11:25:00,0.42,17365.0,United Kingdom

##### Let's proceed with the dataset df_online_retail

In [9]:
df_online_retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [10]:
df_online_retail.shape

(541909, 8)

In [11]:
df_online_retail.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [12]:
# NUll or Missing Data:
#Description      1454
#CustomerID     135080

In [13]:
# Check the uniqueness of the features of the dataset
def unique_features():
    for c in
    np.unique(df_online_retail)

SyntaxError: invalid syntax (<ipython-input-13-1f9132a06819>, line 3)

In [14]:
df_online_retail.columns.values

array(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'], dtype=object)

##### Remember that in future analysis we need to have customers with recency to count(RFM), Below will be the steps to clarify 
##### that some entries are NUll values which needs to be dropped also need to remove the duplicates. So it is crucial
##### to have a check on the dataset whether on using drop_duplicates, are we dropping any essential rows or not??

In [15]:
no_of_unique_CustID = len(np.unique(df_online_retail['CustomerID']))
print(no_of_unique_CustID)

139452

###### let's make CustomerID as index and put it in a new dataframe. And then check the row count using shape.

In [16]:
df_online_retail_test = df_online_retail.set_index('CustomerID')

In [17]:
df_online_retail_test.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,Country
CustomerID,,,,,,,
17850.0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,United Kingdom
17850.0,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,United Kingdom
17850.0,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,United Kingdom
17850.0,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,United Kingdom
17850.0,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,United Kingdom

In [18]:
# this will give unique no of indexes which is same as unique no of CustomerID in df_online_retail dataset.
len(np.unique(df_online_retail_test.index))

139452

In [19]:
# Lets check the shape of the Dataframe before dropping duplicates
df_online_retail_test.shape

(541909, 7)

In [20]:
# let's try to drop the duplicates using "drop_duplicate" function,it means any two or more rows will have exact values,
# We are trying to drop duplicates and then remove the nulls/NaN values without removing the essential values.
df_online_retail_test.drop_duplicates(inplace=True)

In [21]:
df_online_retail_test.shape

(536641, 7)

In [22]:
# so number of duplicate records:
print(f"Number of duplicate records got dropped:\n {541909-536641}")

Number of duplicate records got dropped:
 5268

###### Dropping the duplicates has no effect on feature "Description". So it can be assumed that rows are unique with unique desciptions

In [28]:
df_online_retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [29]:
df_online_retail_test.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 536641 entries, 17850.0 to 12680.0
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    536641 non-null  object
 1   StockCode    536641 non-null  object
 2   Description  535187 non-null  object
 3   Quantity     536641 non-null  int64
 4   InvoiceDate  536641 non-null  datetime64[ns]
 5   UnitPrice    536641 non-null  float64
 6   Country      536641 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 32.8+ MB

In [32]:
df_online_retail_test.isnull().sum() # even after dropping the NUll values remains the same

InvoiceNo         0
StockCode         0
Description    1454
Quantity          0
InvoiceDate       0
UnitPrice         0
Country           0
dtype: int64

In [31]:
536641 - 535187

1454

In [34]:
#reset index of the df_online_retail_test dataframe
df_online_retail_test.reset_index(inplace=True)

In [38]:
df_online_retail_test.head(3)

,index,CustomerID,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,Country
0,0,17850.0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,United Kingdom
1,1,17850.0,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,United Kingdom
2,2,17850.0,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,United Kingdom

In [40]:
#Duplicates rows got handled(Using drop_duplicates) and still got same customer with multiple entries to formulate RFM :)
print(len(np.unique(df_online_retail['CustomerID'])))
print(len(np.unique(df_online_retail_test['CustomerID'])))

139452
139409

In [44]:
df_online_retail_test.isnull().sum()

index               0
CustomerID     135037
InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
Country             0
dtype: int64

In [46]:
print("The below result is the number of CustomerIDs having duplicates:")
print("The result is obtained from ISnull comparision: ",135080-135037)
print("\n"*2)
print("The result is obtained from Unique cust_id comparision: ",139452-139409)

The below result is the number of CustomerIDs having duplicates:
The result is obtained from ISnull comparision:  43



The result is obtained from Unique cust_id comparision:  43

##### So we can infer that only 43 customer ids were having duplicates which are now dropped. Now remove the null values since customer IDs cant be randomly generated nor the Description. This check was not mandatory. We can directly use drop_duplicates and then remove NULLs/NaN.

#### Drop duplicates and remove Nulls from the "df_online_retail" dataset.

In [47]:
df_online_retail.drop_duplicates(inplace=True)

In [49]:
# Before dropping NUlls
df_online_retail.shape

(536641, 8)

In [56]:
df_online_retail.dropna(inplace=True)

In [60]:
# After dropping NUlls
df_online_retail.shape

(401604, 8)

In [59]:
df_online_retail.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 401604 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    401604 non-null  object
 1   StockCode    401604 non-null  object
 2   Description  401604 non-null  object
 3   Quantity     401604 non-null  int64
 4   InvoiceDate  401604 non-null  datetime64[ns]
 5   UnitPrice    401604 non-null  float64
 6   CustomerID   401604 non-null  float64
 7   Country      401604 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.6+ MB

In [ ]:
##### Since time is involved let's do a trend-seasonal Analysis

In [100]:
df_online_retail_test.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 401604 entries, 17850.0 to 12680.0
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    401604 non-null  object
 1   StockCode    401604 non-null  object
 2   Description  401604 non-null  object
 3   Quantity     401604 non-null  int64
 4   InvoiceDate  401604 non-null  datetime64[ns]
 5   UnitPrice    401604 non-null  float64
 6   Country      401604 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 24.5+ MB

In [88]:
df_online_retail_test.drop(columns='index',inplace=True)

In [91]:
df_online_retail_test.set_index('CustomerID',inplace=True)

In [114]:
df_online_retail_test.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,Country
CustomerID,,,,,,,
17850.0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,United Kingdom
17850.0,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,United Kingdom

In [115]:
# New problem statement 1: Analyze for a particular stock.
df_online_retail_test[df_online_retail_test['StockCode']=='84406B'].head(20)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,Country
CustomerID,,,,,,,
17850.0,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,United Kingdom
17850.0,536373,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 09:02:00,2.75,United Kingdom
17850.0,536375,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 09:32:00,2.75,United Kingdom
17850.0,536396,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 10:51:00,2.75,United Kingdom
17850.0,536406,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 11:33:00,2.75,United Kingdom
17850.0,536609,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 09:41:00,2.75,United Kingdom
17850.0,536612,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 09:44:00,2.75,United Kingdom
17850.0,536628,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 10:54:00,2.75,United Kingdom
17850.0,536630,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 10:56:00,2.75,United Kingdom
16244.0,536638,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-02 11:41:00,3.25,United Kingdom
17287.0,536681,84406B,CREAM CUPID HEARTS COAT HANGER,1,2010-12-02 12:22:00,3.25,United Kingdom
17850.0,536685,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 12:23:00,2.75,United Kingdom
17850.0,536690,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 12:25:00,2.75,United Kingdom
17850.0,536750,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 14:04:00,2.75,United Kingdom
17850.0,536752,84406B,CREAM CUPID HEARTS COAT HANGER,6,2010-12-02 14:06:00,2.75,United Kingdom
17850.0,536787,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-02 15:24:00,2.75,United Kingdom
17850.0,536790,84406B,CREAM CUPID HEARTS COAT HANGER,12,2010-12-02 15:26:00,2.75,United Kingdom
16634.0,536832,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-02 17:41:00,3.25,United Kingdom
15808.0,537154,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-05 13:05:00,3.25,United Kingdom
17858.0,537156,84406B,CREAM CUPID HEARTS COAT HANGER,16,2010-12-05 13:08:00,3.25,United Kingdom

In [119]:
print(" For StockCode : 84406B")
print(df_online_retail_test[df_online_retail_test['StockCode']=='84406B'].groupby('InvoiceDate').sum().head(20))
# from this we can formulate or visualize the demand for a particular stock throughout the given range -- important solution
# and in which country it's the highest.

 For StockCode : 84406B
                     Quantity  UnitPrice
InvoiceDate
2010-12-01 08:26:00         8       2.75
2010-12-01 09:02:00         8       2.75
2010-12-01 09:32:00         8       2.75
2010-12-01 10:51:00         8       2.75
2010-12-01 11:33:00         8       2.75
2010-12-02 09:41:00         6       2.75
2010-12-02 09:44:00         6       2.75
2010-12-02 10:54:00         6       2.75
2010-12-02 10:56:00         6       2.75
2010-12-02 11:41:00         8       3.25
2010-12-02 12:22:00         1       3.25
2010-12-02 12:23:00         6       2.75
2010-12-02 12:25:00         6       2.75
2010-12-02 14:04:00         6       2.75
2010-12-02 14:06:00         6       2.75
2010-12-02 15:24:00         8       2.75
2010-12-02 15:26:00        12       2.75
2010-12-02 17:41:00         8       3.25
2010-12-05 13:05:00         8       3.25
2010-12-05 13:08:00        16       3.25

In [145]:
# New problem statement 2: Which countries got how much stock demand and name top 3 coutnries,plot those(using KDE) 
# no need to include invoice-date; do it country wise
cols=['Quantity','UnitPrice','Country']
df_online_retail_test[df_online_retail_test['StockCode']=='84406B'][cols]

            Quantity  UnitPrice         Country
CustomerID
17850.0            8       2.75  United Kingdom
17850.0            8       2.75  United Kingdom
17850.0            8       2.75  United Kingdom
17850.0            8       2.75  United Kingdom
17850.0            8       2.75  United Kingdom
...              ...        ...             ...
16241.0            1       4.15  United Kingdom
13458.0            8       4.15  United Kingdom
17858.0            8       4.15  United Kingdom
14649.0            1       4.15  United Kingdom
13089.0           16       4.15  United Kingdom

[249 rows x 3 columns]

In [ ]:
# Let's build a dataframe with stockcode,quantity,invoicedate,unitprice to calculate total price for each stockcode
df_SC_Quan_InvDate_UP

In [ ]:
# including the invoice-dates as per the customerid

In [79]:
df_test = df_online_retail_test.groupby('CustomerID').sum()

In [80]:
df_test['Total_Price'] = df_test['Quantity'] * df_test['UnitPrice']